ThirdParty-v2012/swak4Foam-latest/Examples/groovyBC/circulatingSplash/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
      //        type            buoyantPressure;
        type            fixedFluxPressure;
        value           uniform 0;
    }

    sides
    {
        //        type            totalPressure;
      //        type            buoyantPressure;
        type            fixedFluxPressure;
        value           uniform 0;
//         type            inletOutlet;
//         inletValue      uniform 0;
//         value           uniform 0;
        //        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
//         rho             none;
//         psi             none;
        gamma           1;
    }

    spill
    {
        //        type            buoyantPressure;
        type            zeroGradient;
        value           uniform 0;
        //        type            inletOutlet;
        //        type fixedValue;
        inletValue      uniform 0;
//         value           uniform 0;
        //        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
//         rho             none;
//         psi             none;
        gamma           1;
    }
    sideSpill
    {
        type symmetry;
    }

    atmosphere {
        //        $spill;
        type    fixedFluxPressure;
        value           uniform 0;
    }

    top
    {
        //        type            buoyantPressure;
        // type            totalPressure;
        type fixedValue;
        globalScopes ( inletPos inletPosInit );
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
        // type groovyBC;
         valueExpression "0";
         gradientExpression "0";
         //         fractionExpression "(gamma>0.01) ? 1 : 0";
         fractionExpression "mag(pos()-inletCenter)<inletRadius ? 1 : 0";
    }
}

// ************************************************************************* //
